load-test.yml
config:
  target: http://localhost:3030/api/v1
  phases:
    - duration: 10
      arrivalRate: 1
      rampTo: 5
      name: Warm up phase
    - duration: 20
      arrivalRate: 5
      rampTo: 10
      name: Ramp up load
    - duration: 30
      arrivalRate: 10
      rampTo: 30
      name: Spike phase

scenarios:
  - name: Get public events
    flow:
      - loop:
        - get:
            url: "/public-events"
        count: 100